Обработки/DataProcessors/_ОповещениеПриИзмененииПеречняАкцийНаОстатках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ОповещениеПриИзмененииПеречняАкцийНаОстатках</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Обработки/DataProcessors/_ОповещениеПриИзмененииПеречняАкцийНаОстатках/_ОповещениеПриИзмененииПеречняАкцийНаОстатках/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		"ДополнительнаяОбработка",
		"Оповещение при изменении перечня акций на остатках",
		"0.05",
		"",
		Истина);
		
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ОповещениеПриИзмененииПеречняАкцийНаОстатках",  "Оповещение при изменении перечня акций на остатках",,  Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

// Интерфейс для запуска обработки
//
// Параметры:
//     ИдентификаторКоманды (строка)  - идентификатор команды
//     ПараметрыОбработки (структура) - структура со свойством ДополнительнаяОбработкаСсылка (ссылка на
//        элемент справочника ДополнительныеОтчетыИОбработки, который связан с данной дополнительной обработкой)
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт
	
	ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды);
	
	ПолучателиОповещения	= ПараметрыКоманды.ПолучателиОповещения;
	Период = ТекущаяДата() - 60 * 60 * 24;
	
	Если ИдентификаторКоманды = "ОповещениеПриИзмененииПеречняАкцийНаОстатках" Тогда
		ПараметрыСессии = ЗарегистрироватьНовуюСессию(ИдентификаторКоманды);
		Попытка
			ОповещениеПриИзмененииПеречняАкцийНаОстатках();
		Исключение
			ДобавитьТекстОшибки(ПараметрыСессии, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКоманду

Процедура ОповещениеПриИзмененииПеречняАкцийНаОстатках() Экспорт 
	
	ТемаПисьма = "За " + Формат(Период, "ДФ=dd.MM.yy") + " добавились/списались акции";
	ТекстПисьма = "";
	ОтправитьОповещение = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(БухПартииЦенныхБумагКонецДня.КоличествоОстаток, 0) - ЕСТЬNULL(БухПартииЦенныхБумагНачалоДня.КоличествоОстаток, 0) > 0
		|			ТОГДА ""добавить""
		|		ИНАЧЕ ""убрать""
		|	КОНЕЦ КАК Действие,
		|	РеквизитыЮридическихЛицСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК Эмитент,
		|	ЕСТЬNULL(БухПартииЦенныхБумагКонецДня.Организация.Наименование, БухПартииЦенныхБумагКонецДня.Организация.Наименование) КАК Организация
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|			Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|				И Организация В
		|					(ВЫБРАТЬ
		|						ЗначенияДополнительныхСведений.Объект
		|					ИЗ
		|						РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|					ГДЕ
		|						ЗначенияДополнительныхСведений.Свойство.Ключ = ""ВнешниеОбработки._ОповещениеПриИзмененииПеречняАкцийНаОстатках.Оповещать""
		|						И ЗначенияДополнительныхСведений.Значение = ИСТИНА)) КАК БухПартииЦенныхБумагКонецДня
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
		|				НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|				Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции)
		|					И Организация В
		|						(ВЫБРАТЬ
		|							ЗначенияДополнительныхСведений.Объект
		|						ИЗ
		|							РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|						ГДЕ
		|							ЗначенияДополнительныхСведений.Свойство.Ключ = ""ВнешниеОбработки._ОповещениеПриИзмененииПеречняАкцийНаОстатках.Оповещать""
		|							И ЗначенияДополнительныхСведений.Значение = ИСТИНА)) КАК БухПартииЦенныхБумагНачалоДня
		|		ПО БухПартииЦенныхБумагКонецДня.ЦеннаяБумага = БухПартииЦенныхБумагНачалоДня.ЦеннаяБумага
		|			И БухПартииЦенныхБумагКонецДня.Организация = БухПартииЦенныхБумагНачалоДня.Организация
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					ИЛИ Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ЕСТЬNULL(БухПартииЦенныхБумагКонецДня.ЦеннаяБумага.Эмитент.ЮрФизЛицо, БухПартииЦенныхБумагНачалоДня.ЦеннаяБумага.Эмитент.ЮрФизЛицо) = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|ГДЕ
		|	(БухПартииЦенныхБумагКонецДня.КоличествоОстаток ЕСТЬ NULL
		|			ИЛИ БухПартииЦенныхБумагНачалоДня.КоличествоОстаток ЕСТЬ NULL)";
		
		
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстПисьма = ТекстПисьма
			+ ?(ОтправитьОповещение, Символы.ПС, "")
			+ "Необходимо " + Выборка.Действие
			+ " Эмитент: " + Выборка.Эмитент
			+ " , ИНН: " + Выборка.ИНН
			+ " (" + Выборка.Организация + ")";
		ОтправитьОповещение = Истина;
	КонецЦикла;
	
	Если ОтправитьОповещение Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТемаПисьма + Символы.ПС + ТекстПисьма);
		РаботаСЭлектроннойПочтой.ОтправитьПростоеЭлектронноеПисьмо(ПолучателиОповещения, ТемаПисьма, ТекстПисьма);	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("За " + Формат(Период, "ДФ=dd.MM.yy") + " перечень акций не поменялся");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

#Область СтатистикаРаботыВнутреннихМеханизмов

Процедура ДобавитьТекстОшибки(ПараметрыСессии, ТекстОшибки) Экспорт

	Если ПараметрыСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыСессии.ТекстОшибки) Тогда
		ПараметрыСессии.ТекстОшибки = ПараметрыСессии.ТекстОшибки + Символы.ПС + ТекстОшибки;
	Иначе
		ПараметрыСессии.ТекстОшибки = ТекстОшибки;
	КонецЕсли;

КонецПроцедуры

Функция ЗарегистрироватьНовуюСессию(ИмяКоманды) Экспорт
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",       Сессия);
	ПараметрыСессии.Вставить("ДопПараметры", Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",  Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии) Экспорт
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
